tap "dart-lang/dart"
tap "homebrew/services"
tap "homeport/tap"
tap "jesseduffield/lazygit"
tap "nutcracker/tap"
tap "rbenv/tap"
tap "sass/sass"
tap "shivammathur/php"
# Asciicast to GIF converter
brew "agg"
# Record and share terminal sessions
brew "asciinema"
# Create and run Linux containers using lightweight virtual machines
brew "container"
# Distributed revision control system
brew "git"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Ruby version manager
brew "rv"
# Creates screenshots based on terminal command output.
brew "homeport/tap/termshot"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Free and open-source web browser
cask "chromium"
# Create and run Linux containers using lightweight virtual machines
cask "container"
cask "font-caskaydia-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Password manager app
cask "keepassxc"
# Web browser
cask "librewolf"
# Clipboard manager
cask "maccy"
# CSV editor
cask "modern-csv"
# Replacement for Docker Desktop
cask "orbstack"
# System monitor for the menu bar
cask "stats"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Multiplayer code editor
cask "zed"
vscode "adamwalzer.scss-lint"
vscode "aliariff.slim-lint"
vscode "anthropic.claude-code"
vscode "appland.appmap"
vscode "bibhasdn.unique-lines"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "castwide.solargraph"
vscode "chaitanyashahare.lazygit"
vscode "crystal-lang-tools.crystal-lang"
vscode "cssho.vscode-svgviewer"
vscode "dbaeumer.vscode-eslint"
vscode "dbankier.vscode-quick-select"
vscode "deerawan.vscode-dash"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "exiasr.hadolint"
vscode "felipecaputo.git-project-manager"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "ionutvmi.spacegray-vscode"
vscode "jetpack-io.devbox"
vscode "kainiklas.composer-intellisense"
vscode "karunamurti.haml"
vscode "koichisasada.vscode-rdbg"
vscode "l13rary.l13-diff"
vscode "marcoroth.herb-lsp"
vscode "marcoroth.stimulus-lsp"
vscode "mechatroner.rainbow-csv"
vscode "metaseed.metago"
vscode "metaseed.metajump"
vscode "metaseed.metaword"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mrmlnc.vscode-apache"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-it"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.copilot-mermaid-diagram"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-speech"
vscode "ms-vscode.vscode-speech-language-pack-it-it"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "mushan.vscode-paste-image"
vscode "neilbrayfield.php-docblocker"
vscode "oderwat.indent-rainbow"
vscode "pavlitsky.yard"
vscode "pomdtr.excalidraw-editor"
vscode "qezhu.gitlink"
vscode "redhat.vscode-yaml"
vscode "robinbentley.sass-indented"
vscode "rogalmic.bash-debug"
vscode "sadesyllas.vscode-workspace-switcher"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "skyapps.fish-vscode"
vscode "sleistner.vscode-fileutils"
vscode "soutaro.rbs-syntax"
vscode "soutaro.steep-vscode"
vscode "standard.vscode-standard"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-italian"
vscode "stuart.unique-window-colors"
vscode "stylelint.vscode-stylelint"
vscode "timonwong.shellcheck"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "trond-snekvik.simple-rst"
vscode "vayan.haml"
vscode "vittorioromeo.expand-selection-to-scope"
vscode "vscode-icons-team.vscode-icons"
vscode "weijunyu.vscode-json-path"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "yaruson.ascii-unicode-escape"
vscode "yzhang.markdown-all-in-one"
vscode "zobo.php-intellisense"
