tap "homeport/tap"
tap "nikitabobko/tap"
tap "rbenv/tap"
tap "shivammathur/php"
# Asciicast to GIF converter
brew "agg"
# Record and share terminal sessions
brew "asciinema"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Create and run Linux containers using lightweight virtual machines
brew "container"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open-source GitLab command-line tool
brew "glab"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# High-performance, asynchronous messaging library
brew "zeromq"
# Interactive environments for writing and running code
brew "jupyterlab"
# Portable Foreign Function Interface library
brew "libffi"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# General-purpose scripting language
brew "php"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Ruby version manager
brew "rv"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Image processing library
brew "vips"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Malware identification and classification tool
brew "yara"
# General-purpose lossless data-compression library
brew "zlib"
# Creates screenshots based on terminal command output.
brew "homeport/tap/termshot", trusted: true
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Free and open-source web browser
cask "chromium"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code@latest"
# Create and run Linux containers using lightweight virtual machines
cask "container"
cask "font-caskaydia-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Password manager app
cask "keepassxc"
# Web browser
cask "librewolf"
# Clipboard manager
cask "maccy"
# CSV editor
cask "modern-csv"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Replacement for Docker Desktop
cask "orbstack"
# System monitor for the menu bar
cask "stats"
# Free and open-source OpenVPN client
cask "tunnelblick"
vscode "adamwalzer.scss-lint"
vscode "aliariff.slim-lint"
vscode "anthropic.claude-code"
vscode "appland.appmap"
vscode "bibhasdn.unique-lines"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "brandoncc.vscode-seeing-is-believing"
vscode "castwide.solargraph"
vscode "chaitanyashahare.lazygit"
vscode "crystal-lang-tools.crystal-lang"
vscode "dbaeumer.vscode-eslint"
vscode "dbankier.vscode-quick-select"
vscode "deerawan.vscode-dash"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "exiasr.hadolint"
vscode "felipecaputo.git-project-manager"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "ionutvmi.spacegray-vscode"
vscode "jetpack-io.devbox"
vscode "kainiklas.composer-intellisense"
vscode "karunamurti.haml"
vscode "koichisasada.vscode-rdbg"
vscode "l13rary.l13-diff"
vscode "mads-hartmann.bash-ide-vscode"
vscode "marcoroth.herb-lsp"
vscode "marcoroth.stimulus-lsp"
vscode "mechatroner.rainbow-csv"
vscode "metaseed.metago"
vscode "metaseed.metajump"
vscode "metaseed.metaword"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mrmlnc.vscode-apache"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-it"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-speech"
vscode "ms-vscode.vscode-speech-language-pack-it-it"
vscode "ms-vsliveshare.vsliveshare"
vscode "mushan.vscode-paste-image"
vscode "oderwat.indent-rainbow"
vscode "pavlitsky.yard"
vscode "pomdtr.excalidraw-editor"
vscode "qezhu.gitlink"
vscode "redhat.vscode-yaml"
vscode "rogalmic.bash-debug"
vscode "sadesyllas.vscode-workspace-switcher"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "skyapps.fish-vscode"
vscode "sleistner.vscode-fileutils"
vscode "soutaro.rbs-syntax"
vscode "soutaro.steep-vscode"
vscode "standard.vscode-standard"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-italian"
vscode "stuart.unique-window-colors"
vscode "stylelint.vscode-stylelint"
vscode "timonwong.shellcheck"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "trond-snekvik.simple-rst"
vscode "vittorioromeo.expand-selection-to-scope"
vscode "vscode-icons-team.vscode-icons"
vscode "weijunyu.vscode-json-path"
vscode "yaruson.ascii-unicode-escape"
vscode "yzhang.markdown-all-in-one"
